# -**- mode: org; coding: utf-8 -**-
#+TITLE: HAP - Generic Document Skeleton
#+SUBTITLE: A GP Simple Document Template for short work...
#+EXPORT_FILE_NAME: HAP_Simple-Document-Skeleton.pdf
#+TEXT: Copyright © 2022 Harmonic Alchemy Productions & Others
#+AUTHOR: Alisha Awen - Harmonic Alchemy Productions
#+EMAIL: Siren1@disroot.org
#+DATE: {{{time(%A %Y-%b-%d)}}}
#+TEXT: Created: <2021-05-21 Fri>
#+TEXT: Last Published: <Not Published>
#+FILETAGS: templates docs unpublished

#+DESCRIPTION: HAP - Generic Document Skeleton with basic structure for smaller documents that don't require so much planning etc. Great for simple outlines, one page docs, short How-Tos, etc., (easily modified to make reports, charts, etc.)  Publishable as a Simple PDF...

#+BEGIN_COMMENT

=Setup Files:=

   For Cloned Versions of this template, the file/paths below will be relative
   to your parent project directory and as such, should be all set to your new: ~.../your-simple-document-project/org-templates/~ directory...

   *SETUPFILE:* ~simple-doc-setup.org~ is for LaTeX Export Configurations 
              to produce a Simple Document styled PDF

   *SETUPFILE:* ~default-tags.org~ is where tags are set for this project...

              If you need to change the category, do it in your cloned version
              of default-tags.org...  If you rename default-tags.org file from
              "default" to something more specific, you will need to change the
              ~#+SETUPFILE: ./org-templates/default-tags.org~ line below to reflect
              your new file name as well...  You may change any of the tags except
              important ones to what ever you wish... Read the *:README:* drawer
              within the file for more information...

              The Existing Tags are useful for most situations within
              this context, and some of the tags MUST ALWAYS be defined
              for this LaTeX publishing system to work correctly...

*** NEW 📄 Heading S /(template with src-code blocks, etc. - rename this)/

- *SysAdmin & Command Prompts:*

   #+begin_src conf
   admin@vps1:~$ sudo apt update
   #+end_src

   #+begin_src conf
   user@home:~$ git status
   #+end_src

- *Evaluate some eLisp code:*

   #+begin_src emacs-lisp
   (defvar test1 "test1 value")
   (defvar test2 "test2 value")
   test2
   #+end_src

   #+results:
   : test2 value

   #+begin_src emacs-lisp
   (defvar test1 "test1 value")
   (defvar test2 "test2 value")
   test1
   #+end_src

   #+results:
   : test1 value

